In [1]:
import pandas as pd
import numpy as np

ImportError: Unable to import required dependencies:
numpy: Error importing numpy: you should not try to import numpy from
        its source directory; please exit the numpy source tree, and relaunch
        your python interpreter from there.

In [2]:
df = pd.read_csv('employees.csv')

In [3]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [4]:
df.shape

(1000, 8)

In [8]:
df.describe()

              Salary      Bonus %
count    1000.000000  1000.000000
mean    90662.181000    10.207555
std     32923.693342     5.528481
min     35013.000000     1.015000
25%     62613.000000     5.401750
50%     90428.000000     9.838500
75%    118740.250000    14.838000
max    149908.000000    19.944000

In [13]:
salary = df['Salary']

In [15]:
salary

0       97308
1       61933
2      130590
3      138705
4      101004
        ...
995    132483
996     42392
997     96914
998     60500
999    129949
Name: Salary, Length: 1000, dtype: int64

In [16]:
salary[4]

101004

In [20]:
salary = salary.sort_values()

In [23]:
salary = salary.s

In [24]:
salary

0       97308
1       61933
2      130590
3      138705
4      101004
        ...
995    132483
996     42392
997     96914
998     60500
999    129949
Name: Salary, Length: 1000, dtype: int64

In [26]:
salary_array = np.array(salary)

In [28]:
salary_array.sort()

In [29]:
salary_array

array([ 35013,  35061,  35095,  35203,  35381,  35477,  35575,  35633,
        35802,  35884,  36067,  36403,  36643,  36697,  36711,  36749,
        36759,  36837,  36844,  36927,  36946,  37005,  37076,  37259,
        37385,  37598,  37748,  37812,  37888,  37916,  37919,  37984,
        38041,  38078,  38092,  38275,  38344,  38375,  38712,  38872,
        38989,  39335,  39371,  39833,  40119,  40121,  40297,  40341,
        40451,  40837,  41054,  41126,  41190,  41230,  41238,  41334,
        41426,  41427,  41428,  41449,  41453,  41549,  41643,  41808,
        41831,  41928,  42025,  42087,  42090,  42146,  42153,  42214,
        42296,  42341,  42392,  42424,  42553,  42676,  42748,  43026,
        43050,  43252,  43312,  43354,  43414,  43455,  43542,  43586,
        43694,  44021,  44486,  44537,  44639,  44836,  44857,  45094,
        45150,  45181,  45223,  45267,  45418,  45682,  45724,  45906,
        46007,  46080,  46233,  46240,  46378,  46478,  46602,  46665,
        46666,  46750,  46829,  46875,  46905,  46930,  46953,  47079,
        47176,  47232,  47266,  47322,  47369,  47529,  47605,  47638,
        47647,  47885,  48046,  48109,  48141,  48354,  48668,  48696,
        48866,  49101,  49325,  49339,  49368,  49473,  49501,  49538,
        49542,  49665,  50141,  50167,  50366,  50369,  50426,  50455,
        50529,  50645,  50701,  50905,  51065,  51070,  51082,  51178,
        51395,  51430,  51431,  51525,  51613,  51633,  51667,  51685,
        51821,  51923,  52080,  52119,  52226,  52620,  52730,  52875,
        52970,  53061,  53335,  53692,  53754,  53954,  54033,  54043,
        54058,  54585,  54941,  55038,  55044,  55281,  55394,  56450,
        56526,  56580,  56926,  56961,  56993,  57266,  57286,  57292,
        57300,  57325,  57427,  57531,  57783,  57811,  57871,  58047,
        58112,  58129,  58248,  58295,  58327,  58357,  58423,  58478,
        58520,  58563,  58698,  58755,  58789,  59070,  59148,  59277,
        59414,  59678,  59680,  59728,  59862,  59937,  59943,  59969,
        59970,  60003,  60263,  60361,  60388,  60411,  60500,  60866,
        61117,  61181,  61310,  61602,  61933,  61999,  62096,  62161,
        62371,  62454,  62666,  62719,  62913,  62960,  63046,  63103,
        63126,  63241,  63395,  63494,  63549,  63571,  63888,  64084,
        64088,  64164,  64172,  64207,  64363,  64579,  64714,  64715,
        65078,  65168,  65251,  65362,  65476,  65482,  65673,  65931,
        66029,  66047,  66067,  66077,  66146,  66224,  66521,  66582,
        66604,  66757,  66775,  66819,  66820,  66851,  67150,  67165,
        67471,  67656,  67780,  67789,  67811,  67827,  68028,  68164,
        68230,  68501,  68680,  68759,  69111,  69112,  69134,  69244,
        69267,  69268,  69297,  69579,  69740,  69906,  69989,  70248,
        70367,  70492,  70635,  70817,  70990,  71276,  71383,  71430,
        71520,  71642,  71715,  71749,  71751,  71853,  71896,  71930,
        71945,  71958,  71975,  72002,  72145,  72257,  72613,  72670,
        72893,  72979,  73105,  73354,  73437,  73524,  73587,  73706,
        73749,  73789,  73935,  74086,  74104,  74129,  74287,  74640,
        74669,  74911,  75145,  75147,  75150,  75181,  75415,  75423,
        75484,  75498,  75598,  75607,  75661,  75825,  76076,  76078,
        76189,  76381,  76394,  76409,  76485,  76707,  77287,  77327,
        77544,  77834,  77933,  78226,  78351,  78417,  78883,  78891,
        79047,  79123,  79145,  79443,  79459,  79529,  79536,  79582,
        79796,  79906,  80399,  80633,  80688,  80740,  80803,  80838,
        81014,  81077,  81183,  81206,  81215,  81308,  81444,  81673,
        81800,  81839,  81919,  82401,  82408,  82439,  82726,  82744,
        82782,  82871,  82873,  82884,  83072,  83112,  83159,  83341,
        83658,  83677,  83706,  83809,  83895,  84232,  84546,  84672,
        84692,  84693,  84746,  84810,  84834,  84885,  85074,  85182,
        85213,  85215,  85446,  85550,  85668,  85700,  85718,  85730,
        85789,  85799,  85858,  85871,  86150,  86230,  86318,  86326,
        86386,  86439,  86564,  86615,  86676,  86676,  86723,  86818,
        86883,  87103,  87145,  87298,  87575,  87713,  87715,  87721,
        87760,  88010,  88086,  88276,  88657,  88733,  89227,  89258,
        89434,  89443,  89661,  89700,  89780,  89786,  89831,  89854,
        90187,  90285,  90370,  90427,  90429,  90556,  90582,  90719,
        90730,  90816,  90829,  90998,  91109,  91124,  91133,  91344,
        91406,  91411,  91462,  91462,  91522,  91712,  91719,  91996,
        92242,  92430,  92436,  92544,  92587,  92799,  93022,  93201,
        93302,  93368,  93581,  93712,  93753,  93847,  93901,  93997,
        94088,  94231,  94345,  94393,  94493,  94963,  94976,  95003,
        95198,  95296,  95322,  95327,  95389,  95570,  95728,  95734,
        95866,  96111,  96250,  96329,  96511,  96610,  96633,  96649,
        96795,  96914,  96941,  96978,  97058,  97308,  97364,  97370,
        97443,  97480,  97490,  97566,  97635,  97691,  97915,  97950,
        98233,  98295,  98385,  98393,  98406,  98753,  98811,  98841,
        98858,  98865,  98874,  99150,  99283,  99326,  99747, 100238,
       100308, 100341, 100612, 100705, 100765, 100863, 100888, 100949,
       101004, 101036, 101262, 101457, 101914, 101941, 102081, 102488,
       102508, 102555, 102577, 102589, 102626, 102652, 102697, 102839,
       102841, 103050, 103235, 103386, 103405, 103495, 103521, 103557,
       103684, 103854, 103877, 103902, 104014, 104058, 104250, 104496,
       104749, 104815, 104840, 104896, 104897, 105062, 105066, 105573,
       105681, 105689, 105946, 106115, 106249, 106310, 106317, 106362,
       106406, 106428, 106472, 106562, 106862, 106947, 106995, 107024,
       107050, 107111, 107163, 107281, 107351, 107391, 107816, 108127,
       108581, 108946, 109095, 109259, 109260, 109290, 109324, 109411,
       109510, 109517, 109564, 109588, 109831, 109980, 110061, 110169,
       110194, 110306, 110485, 110924, 110967, 111043, 111163, 111249,
       111371, 111376, 111468, 111580, 111737, 111786, 111858, 112117,
       112238, 112467, 112548, 112769, 112807, 112975, 113060, 113129,
       113425, 113506, 113554, 113590, 113592, 113732, 113760, 113850,
       114079, 114244, 114334, 114356, 114360, 114412, 114767, 114796,
       114797, 114896, 115057, 115118, 115145, 115149, 115163, 115194,
       115280, 115387, 115436, 115566, 115582, 115658, 115711, 115814,
       115913, 116236, 116693, 116931, 117055, 117293, 117787, 118037,
       118043, 118172, 118369, 118431, 118733, 118736, 118753, 118780,
       118840, 118906, 119009, 119082, 119266, 119667, 119735, 120204,
       120444, 120672, 120675, 120941, 121006, 121068, 121160, 121160,
       121232, 121250, 121333, 121357, 121477, 121508, 121604, 121723,
       121797, 121816, 121918, 122121, 122173, 122319, 122340, 122367,
       122717, 122762, 122897, 122920, 122971, 123144, 123294, 123409,
       123591, 123621, 123649, 123711, 123811, 123876, 123940, 123963,
       124008, 124365, 124441, 124486, 124488, 124566, 124655, 124889,
       125018, 125033, 125104, 125220, 125250, 125298, 125382, 125418,
       125556, 125574, 125792, 125881, 126010, 126120, 126232, 126310,
       126924, 126956, 127118, 127297, 127654, 127813, 128031, 128036,
       128042, 128175, 128305, 128540, 128771, 129148, 129297, 129460,
       129663, 129712, 129949, 129968, 130276, 130577, 130581, 130590,
       130620, 131038, 131045, 131131, 131423, 131513, 131604, 131755,
       131943, 131952, 132084, 132156, 132175, 132327, 132373, 132381,
       132483, 132505, 132839, 132940, 133033, 133366, 133472, 133772,
       133943, 133980, 134048, 134120, 134148, 134408, 134505, 134598,
       134610, 134645, 134673, 134988, 135118, 135119, 135352, 135369,
       135490, 135758, 135882, 135990, 136032, 136602, 136604, 136655,
       136681, 136709, 136984, 137126, 137144, 137171, 137314, 137359,
       137386, 137661, 137840, 137954, 137979, 138598, 138705, 138807,
       138925, 139284, 139570, 139754, 139791, 139852, 139917, 139959,
       140002, 140013, 140136, 140303, 140347, 140371, 140444, 140502,
       140558, 140810, 140850, 140885, 141069, 141305, 141311, 141335,
       141439, 141498, 141521, 141932, 141958, 142032, 142178, 142208,
       142321, 142373, 142410, 142415, 142561, 142868, 142935, 143499,
       143541, 143638, 144001, 144082, 144187, 144474, 144677, 144701,
       144709, 144887, 145001, 145146, 145274, 145316, 145329, 145357,
       145988, 145988, 146129, 146141, 146589, 146651, 146670, 146812,
       146907, 147113, 147183, 147183, 147309, 147362, 147417, 147635,
       147663, 147842, 148115, 148225, 148291, 148339, 148857, 148941,
       148985, 149105, 149456, 149563, 149654, 149684, 149903, 149908],
      dtype=int64)

In [37]:
( salary_array[0] + salary_array[999] ) / 2

92460.5

In [39]:
salary_array[499]

90427

In [46]:
salary_array[522]

92436

In [47]:
salary_array[523]

92544

In [48]:
( salary_array[522] + salary_array[523]) / 2

92490.0

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [56]:
df.isna().sum()

First Name            67
Gender               145
Start Date             0
Last Login Time        0
Salary                 0
Bonus %                0
Senior Management     67
Team                  43
dtype: int64

In [58]:
df['Start Date'] = pd.to_datetime(df['Start Date'])

In [59]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,4:47 PM,101004,1.389,True,Client Services

In [60]:
df.nunique()

First Name           200
Gender                 2
Start Date           972
Last Login Time      720
Salary               995
Bonus %              971
Senior Management      2
Team                  10
dtype: int64

In [62]:
df.notnull().sum()

First Name            933
Gender                855
Start Date           1000
Last Login Time      1000
Salary               1000
Bonus %              1000
Senior Management     933
Team                  957
dtype: int64

In [64]:
df.ndim

2

In [73]:
df.nsmallest(5, 'Salary')

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
576,Michael,Male,1993-07-30,5:35 PM,35013,14.879,False,Product
238,Kevin,Male,1982-03-25,7:31 AM,35061,5.128,False,Legal
82,Steven,Male,1980-03-30,9:20 PM,35095,8.379,True,Client Services
63,Matthew,Male,2013-01-02,10:33 PM,35203,18.040,False,Human Resources
650,Cynthia,Female,1986-07-05,1:24 AM,35381,11.749,False,Finance

In [82]:
df[df['Gender'].isnull()]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
20,Lois,NaN,1995-04-22,7:18 PM,64714,4.934,True,Legal
22,Joshua,NaN,2012-03-08,1:58 AM,90816,18.816,True,Client Services
27,Scott,NaN,1991-07-11,6:58 PM,122367,5.218,False,Legal
31,Joyce,NaN,2005-02-20,2:40 PM,88657,12.752,False,Product
41,Christine,NaN,2015-06-28,1:08 AM,66582,11.308,True,Business Development
...,...,...,...,...,...,...,...,...
961,Antonio,NaN,1989-06-18,9:37 PM,103050,3.050,False,Legal
972,Victor,NaN,2006-07-28,2:49 PM,76381,11.159,True,Sales
985,Stephen,NaN,1983-07-10,8:10 PM,85668,1.909,False,Legal
989,Justin,NaN,1991-02-10,4:58 PM,38344,3.794,False,Legal
995,Henry,NaN,2014-11-23,6:09 AM,132483,16.655,False,Distribution

In [83]:
df['Gender'].fillna("No Gender", inplace=True )

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             1000 non-null   object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(1), object(5)
memory usage: 62.6+ KB

In [88]:
df.isna().sum()

First Name           67
Gender                0
Start Date            0
Last Login Time       0
Salary                0
Bonus %               0
Senior Management    67
Team                 43
dtype: int64

In [89]:
df()

KeyError: 0

In [1]:
from textblob import TextBlob

ModuleNotFoundError: No module named 'textblob'

In [2]:
pip install textblob

Collecting textblob
  Downloading textblob-0.18.0.post0-py3-none-any.whl.metadata (4.5 kB)
Collecting nltk>=3.8 (from textblob)
  Downloading nltk-3.8.1-py3-none-any.whl.metadata (2.8 kB)
Collecting click (from nltk>=3.8->textblob)
  Downloading click-8.1.7-py3-none-any.whl.metadata (3.0 kB)
Requirement already satisfied: joblib in c:\python\python312\lib\site-packages (from nltk>=3.8->textblob) (1.3.2)
Collecting regex>=2021.8.3 (from nltk>=3.8->textblob)
  Downloading regex-2024.5.15-cp312-cp312-win_amd64.whl.metadata (41 kB)
     ---------------------------------------- 0.0/42.0 kB ? eta -:--:--
     ---------------------------------------- 0.0/42.0 kB ? eta -:--:--
     ---------------------------------------- 0.0/42.0 kB ? eta -:--:--
     ----------------------------- ---------- 30.7/42.0 kB 1.4 MB/s eta 0:00:01
     ----------------------------- ---------- 30.7/42.0 kB 1.4 MB/s eta 0:00:01
     -------------------------------------- 42.0/42.0 kB 337.6 kB/s eta 0:00:00
Requirement already satisfied: tqdm in c:\python\python312\lib\site-packages (from nltk>=3.8->textblob) (4.66.4)
Requirement already satisfied: colorama in c:\python\python312\lib\site-packages (from click->nltk>=3.8->textblob) (0.4.6)
Downloading textblob-0.18.0.post0-py3-none-any.whl (626 kB)
   ---------------------------------------- 0.0/626.3 kB ? eta -:--:--
   - -------------------------------------- 30.7/626.3 kB 1.4 MB/s eta 0:00:01
   ----- ---------------------------------- 81.9/626.3 kB 1.2 MB/s eta 0:00:01
   -------- ------------------------------- 133.1/626.3 kB 1.6 MB/s eta 0:00:01
   -------- ------------------------------- 133.1/626.3 kB 1.6 MB/s eta 0:00:01
   -------- ------------------------------- 133.1/626.3 kB 1.6 MB/s eta 0:00:01
   -------------------- ------------------- 327.7/626.3 kB 1.4 MB/s eta 0:00:01
   ------------------------------- -------- 491.5/626.3 kB 1.7 MB/s eta 0:00:01
   ---------------------------------- ----- 542.7/626.3 kB 1.9 MB/s eta 0:00:01
   ---------------------------------- ----- 542.7/626.3 kB 1.9 MB/s eta 0:00:01
   ---------------------------------------  624.6/626.3 kB 1.5 MB/s eta 0:00:01
   ---------------------------------------- 626.3/626.3 kB 1.5 MB/s eta 0:00:00
Downloading nltk-3.8.1-py3-none-any.whl (1.5 MB)
   ---------------------------------------- 0.0/1.5 MB ? eta -:--:--
   ----- ---------------------------------- 0.2/1.5 MB ? eta -:--:--
   ------------------- -------------------- 0.7/1.5 MB 9.5 MB/s eta 0:00:01
   ---------------------------------- ----- 1.3/1.5 MB 9.3 MB/s eta 0:00:01
   ---------------------------------------- 1.5/1.5 MB 9.6 MB/s eta 0:00:00
Downloading regex-2024.5.15-cp312-cp312-win_amd64.whl (268 kB)
   ---------------------------------------- 0.0/268.5 kB ? eta -:--:--
   --------------------------------------- 268.5/268.5 kB 16.1 MB/s eta 0:00:00
Downloading click-8.1.7-py3-none-any.whl (97 kB)
   ---------------------------------------- 0.0/97.9 kB ? eta -:--:--
   ---------------------------------------- 97.9/97.9 kB 5.5 MB/s eta 0:00:00
Installing collected packages: regex, click, nltk, textblob
Successfully installed click-8.1.7 nltk-3.8.1 regex-2024.5.15 textblob-0.18.0.post0
Note: you may need to restart the kernel to use updated packages.

In [1]:
from textblob import TextBlob

In [2]:
#misspelled words
blob = TextBlob("I havv a guud ideea")

# Perform spelling correction
corrected_blob = blob.correct()

# Print the corrected Text
print("Original Text : ", blob)
print("Corrected Text : ", corrected_blob)

Original Text :  I havv a guud ideea
Corrected Text :  I have a good idea